In [2]:
import pandas as pd
import sqlite3

In [16]:
orders_df = pd.read_csv("orders.csv")
orders_df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name
0,1,2508,450,18-02-2023,842.97,New Foods Chinese
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian

In [12]:
users_df = pd.read_json("users.json")
users_df.head()

   user_id    name       city membership
0        1  User_1    Chennai    Regular
1        2  User_2       Pune       Gold
2        3  User_3  Bangalore       Gold
3        4  User_4  Bangalore    Regular
4        5  User_5       Pune       Gold

In [13]:
with open(
   r"C:\Users\priya\Downloads\restaurants.sql", "r"
) as f:
    sql_script = f.read()

In [14]:
conn = sqlite3.connect(":memory:")
cursor = conn.cursor()

with open("restaurants.sql", "r") as f:
    sql_script = f.read()

cursor.executescript(sql_script)
conn.commit()

restaurants_df = pd.read_sql(
    "SELECT * FROM restaurants",
    conn
)

restaurants_df.head()

   restaurant_id restaurant_name  cuisine  rating
0              1    Restaurant_1  Chinese     4.8
1              2    Restaurant_2   Indian     4.1
2              3    Restaurant_3  Mexican     4.3
3              4    Restaurant_4  Chinese     4.1
4              5    Restaurant_5  Chinese     4.8

In [20]:
orders_df = pd.read_csv("orders.csv")
orders_df.head()
users_df = pd.read_json("users.json")
users_df.head()
with open(
   r"C:\Users\priya\Downloads\restaurants.sql", "r"
) as f:
    sql_script = f.read()


orders_users_df = pd.merge(
    orders_df,
    users_df,
    on="user_id",
    how="left"
)

final_df = pd.merge(
    orders_users_df,
    restaurants_df,
    on="restaurant_id",
    how="left"
)

final_df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0

In [21]:
final_df.to_csv(
    "final_food_delivery_dataset.csv",
    index=False
)

In [26]:
final_df[final_df["membership"]=="Gold"] \
        .groupby("city")["total_amount"] \
        .sum() \
        .sort_values(ascending=False)

city
Chennai      1080909.79
Pune         1003012.32
Bangalore     994702.59
Hyderabad     896740.19
Name: total_amount, dtype: float64

In [27]:
final_df.groupby("cuisine")["total_amount"].mean().sort_values(ascending=False)

cuisine
Mexican    808.021344
Italian    799.448578
Indian     798.466011
Chinese    798.389020
Name: total_amount, dtype: float64

In [28]:
(final_df.groupby("user_id")["total_amount"].sum() > 1000).sum()

np.int64(2544)

In [30]:
final_df["rating_range"] = pd.cut(
    final_df["rating"],
    bins=[3,3.5,4,4.5,5],
    labels=["3.0–3.5","3.6–4.0","4.1–4.5","4.6–5.0"]
)

In [31]:
final_df.groupby("rating_range")["total_amount"].sum().sort_values(ascending=False)

C:\Users\priya\AppData\Local\Temp\ipykernel_9548\2540198835.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  final_df.groupby("rating_range")["total_amount"].sum().sort_values(ascending=False)

rating_range
4.6–5.0    2197030.75
4.1–4.5    1960326.26
3.0–3.5    1881754.57
3.6–4.0    1717494.41
Name: total_amount, dtype: float64

In [32]:
final_df[final_df["membership"]=="Gold"].groupby("city")["total_amount"].mean().sort_values(ascending=False)

city
Chennai      808.459080
Hyderabad    806.421034
Bangalore    793.223756
Pune         781.162243
Name: total_amount, dtype: float64

In [33]:
final_df.groupby("cuisine").agg(
    restaurants=("restaurant_id","nunique"),
    revenue=("total_amount","sum")
).sort_values(["restaurants","revenue"], ascending=[True,False])

         restaurants     revenue
cuisine
Chinese          120  1930504.65
Italian          126  2024203.80
Indian           126  1971412.58
Mexican          128  2085503.09

In [34]:
round((final_df[final_df["membership"]=="Gold"].shape[0] / final_df.shape[0]) * 100)

50

In [35]:
final_df.groupby("restaurant_name_y").agg(
    orders=("order_id","count"),
    aov=("total_amount","mean")
).query("orders < 20").sort_values("aov", ascending=False)

                   orders          aov
restaurant_name_y
Restaurant_294         13  1040.222308
Restaurant_262         18  1029.473333
Restaurant_77          12  1029.180833
Restaurant_193         15  1026.306667
Restaurant_7           16  1002.140625
...                   ...          ...
Restaurant_184         19   621.828947
Restaurant_498         18   596.815556
Restaurant_192         14   589.972857
Restaurant_329         15   578.578667
Restaurant_300         17   572.686471

[241 rows x 2 columns]

In [36]:
final_df.groupby(["membership","cuisine"])["total_amount"].sum().sort_values(ascending=False)

membership  cuisine
Regular     Mexican    1072943.30
            Italian    1018424.75
Gold        Mexican    1012559.79
            Italian    1005779.05
Regular     Indian      992100.27
Gold        Indian      979312.31
            Chinese     977713.74
Regular     Chinese     952790.91
Name: total_amount, dtype: float64

In [39]:
final_df["order_date"] = pd.to_datetime(final_df["order_date"])
final_df["quarter"] = final_df["order_date"].dt.to_period("Q")

final_df.groupby("quarter")["total_amount"].sum().sort_values(ascending=False)

quarter
2023Q3    2037385.10
2023Q4    2018263.66
2023Q1    1993425.14
2023Q2    1945348.72
2024Q1      17201.50
Freq: Q-DEC, Name: total_amount, dtype: float64

In [40]:
total_gold_orders = final_df[final_df["membership"]=="Gold"].shape[0]
print(total_gold_orders)

4987

In [41]:

total_hyderabad_revenue = round(final_df[final_df["city"]=="Hyderabad"]["total_amount"].sum())
print(total_hyderabad_revenue)

1889367

In [42]:
distinct_users = final_df["user_id"].nunique()
print(distinct_users)

2883

In [43]:
avg_gold_order_value = round(final_df[final_df["membership"]=="Gold"]["total_amount"].mean(), 2)
print(avg_gold_order_value)

797.15

In [44]:
high_rating_orders = final_df[final_df["rating"] >= 4.5].shape[0]
print(high_rating_orders)

3374

In [45]:
top_gold_city = final_df[final_df["membership"]=="Gold"].groupby("city")["total_amount"].sum().idxmax()


orders_top_gold_city = final_df[(final_df["membership"]=="Gold") & (final_df["city"]==top_gold_city)].shape[0]
print(orders_top_gold_city)

1337

In [46]:
final_df.shape[0]

10000

In [47]:

revenue_by_combo = final_df.groupby(["membership", "cuisine"])["total_amount"].sum()


highest_revenue_combo = revenue_by_combo.idxmax()
highest_revenue_amount = revenue_by_combo.max()

print("Highest revenue combination:", highest_revenue_combo)
print("Revenue amount:", highest_revenue_amount)

Highest revenue combination: ('Regular', 'Mexican')
Revenue amount: 1072943.3

In [48]:

revenue_by_quarter = final_df.groupby("quarter")["total_amount"].sum()


highest_revenue_quarter = revenue_by_quarter.idxmax()
highest_revenue_amount = revenue_by_quarter.max()

print("Quarter with highest revenue:", highest_revenue_quarter)
print("Revenue amount:", highest_revenue_amount)

Quarter with highest revenue: 2023Q3
Revenue amount: 2037385.1

In [49]:

restaurant_stats = final_df.groupby("restaurant_name_y").agg(
    orders=("order_id", "count"),
    aov=("total_amount", "mean")
)


small_restaurants = restaurant_stats[restaurant_stats["orders"] < 20]


highest_aov_restaurant = small_restaurants["aov"].idxmax()
highest_aov_value = small_restaurants["aov"].max()

print("Restaurant with highest AOV (<20 orders):", highest_aov_restaurant)
print("Average Order Value:", round(highest_aov_value, 2))

Restaurant with highest AOV (<20 orders): Restaurant_294
Average Order Value: 1040.22